final_list = [
		'노을 미소', '햇살 바람', '차가운 바람', '푸른 꿈', '달빛 춤', '노을 하늘', 
		'달빛 바다', '차가운 미소', '아름다운 바람', '시린 바람', '다시 이슬', 
		'푸른 파도', '겨울 별', ' 노을 바다', '차가운 겨울', '아름다운 별', 
		'달빛 노래', '바람의  춤', '노을 춤', '아침 물방울', '달빛 미소', 
		'시린 들', '별빛 춤', '푸른 별', '푸른  숲', '당신의 미소', '작은 호수', 
		'산 속에', '아름다운 물결', '아름다운 바다', '햇살 웃음', '아침 햇살', 
		'별빛 하늘', '겨울 노래', '햇살 파도', '푸른 미소', '물방울 호수', 
		'아침 미소', '겨울 파도', '아름다운 꿈', '차가운 별', '당신의 봄', 
		'푸른 하늘', '별빛 노래', '다시 미소', '겨울 하늘', '작은 파도', 
		'아름다운 호수', '가을 노래', '바다 노래', '모두 위로', '흘러 항상', '지금 우린', '계속 위로', '이미 사랑', 
              '정말 몰라', '그때 위로', '그냥 믿어', '매일 만나', '위로 너도', 
              '정말 멀리', '여전히 사랑', '너도 못해', '믿어 다시', '모두 사랑', 
              '믿어 매일', '계속 멀리', '사랑 다시', '마음 위로', '이건 싫어',
              '위로 하지만', '몰라 미안', '언제나 만나', '제발 이젠', '자꾸 만나', 
              '전부 항상', '다시 여기', '싫어 미안', '우린 언제나', '빨리 믿어', 
              '다시 하나', '바로 오늘', '우린 계속', '흘러 자꾸', '다시 함께', 
              '그냥 사람', '흘러 다시', '가끔 만나', '몰라 아직', '사람 몰라', 
             '지금 살아',  '함께 전부', '항상 위로','사랑 미안', '다시 못해', 
              '전부 위로', '살아 오늘', '만나 절대', '여전히 여기', '빨리 필요'
]

words = list(set(final_list))

print("중복 제거 후:", words)
print(len(final_list))